////1.5位运动员参加了10米台跳水比赛，有人让他们预测比赛结果 
////A选手说：B第二，我第三；
////B选手说：我第二，E第四；
////C选手说：我第一，D第二；
////D选手说：C最后，我第三；
////E选手说：我第四，A第一；
////比赛结束后，每位选手都说对了一半，请编程确定比赛的名次。
////思路：这题是要求对于5个人说的话进行真假判断，由于这5个人说的话只有50%的概率
////正确，所以我们采取逻辑或进行判定，最后可以将这5个人说的话通过与在进行判断是
////否等于1，如果等于1那么则说明是真，输出他们的值。
//#include<stdio.h>
//#include<stdlib.h>
//int main() {
//	int A = 0;
//	int B = 0;
//	int C = 0;
//	int D = 0;
//	int E = 0;
//	//对于这5个人他们每个人分别有5种情况，所以通过循环表示
//	for(A=1;A<=5;A++)
//		for(B=1;B<=5;B++)
//			for(C=1;C<=5;C++)
//				for(D=1;D<=5;D++)
//					for (E = 1; E <= 5; E++) {
//						if ((B == 2 || A == 3) && (B == 2 || E == 4) && 
//							(C == 1 || D == 2) && (C == 5 || D == 3) 
//							                   && (E == 4 || A == 1) == 1) {
//							printf("A=%d,B=%d,C=%d,D=%d,E=%d\n", A, B, C, D, E);
//						}
//					}
//	system("pause");
//	return 0;
//}

////2.日本某地发生了一件谋杀案，警察通过排查确定杀人凶手必为4个
////嫌疑犯的一个。以下为4个嫌疑犯的供词。
////A说：不是我。
////B说：是C。
////C说：是D。
////D说：C在胡说
////已知3个人说了真话，1个人说的是假话。
////现在请根据这些信息，写一个程序来确定到底谁是凶手。
////思路：根据要求只有三个人说的是真话，通过ASCII码遍历对他们进行判断，如果为真则加
////1操作，当加到3的时候就表示这种情况可以，那么则输出;
////总共有4人分别为A,B,C,D对他们的ASCII码进行判定
////在进行判断的时候真用1表示，假用0表示。
//#include<stdio.h>
//#include<stdlib.h>
//int main() {
//	int criminal = 0;
//	for (criminal = 'A'; criminal <= 'D'; criminal++) {
//		if ((criminal != 'A') + (criminal == 'C') + (criminal == 'D') 
//			+ (criminal != 'D')==3) {
//			//说明只有一个条件为假
//			printf("凶手是：%c", criminal);
//		}
//	}
//	system("pause");
//	return 0;
//}

//3.在屏幕上打印杨辉三角。 
//1
//1 1
//1 2 1
//1 3 3 1
//思路：将杨辉三角形放在一个矩阵里面，这样的话可以通过行列的关系得到每个位置
//的元素值
#include<stdio.h>
#include<stdlib.h>
int main() {
	int a[3][3] = { 1 };
	int i = 0;
	int j = 0;
		for (i = 0; i <= 3; ++i) {
			a[i][0] = 1;//每一行的首元素都为0
			for (j = 1; j <= i; j++) {
					a[i][j] = a[i - 1][j - 1] + a[i - 1][j];
			}
		}
		for (i = 0; i <= 3; ++i) {
			for (j = 0; j <= i; j++) {
					printf("%d", a[i][j]);
			}
			printf("\n");
		}
	system("pause");
	return 0;
}